app/views/sulabh_loan_requests/_form.html.erb

SELECT "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."mobile" = ?  [["mobile", "8056149278"]]
---
		<%= f.label "Requestor" %><br/>
		<%= f.hidden_field :sulabh_user_profile_id, :value => SulabhUserProfile.where(:mobile => current_user.phoneno)[0].id %>