app/views/sulabh_loan_requests/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  <strong>Username:</strong>
  <%= SulabhUserProfile.find(@sulabh_loan_request.sulabh_user_profile_id).name %>