app/views/sulabh_loan_offers/_form.html.erb

    <%= f.label :sulabh_user_profile_id %><br>
    <%= f.hidden_field :sulabh_user_profile_id, :value => SulabhUserProfile.where(:mobile => current_user.phoneno)[0].id %>
---
SELECT "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."mobile" = ?  [["mobile", "8056149278"]]