app/views/sulabh_loan_offers/index.html.erb

SELECT  "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
          <td>
            <%= SulabhUserProfile.find(sulabh_loan_offer.sulabh_user_profile_id).name %>