app/views/sulabh_loan_offers/show.html.erb

    <strong>Username </strong>
    <%= SulabhUserProfile.find(@sulabh_loan_offer.sulabh_user_profile_id).name %>
---
SELECT  "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]