app/views/fluidic/_prov_loan_table.html.erb

        <% if (sulabh_loan_request && sulabh_loan_request.sulabh_user_profile_id != nil) %>
          <%= SulabhUserProfile.find(sulabh_loan_request.sulabh_user_profile_id).name %>
---
SELECT  "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]