app/views/fluidic/_req_loan_table.html.erb

SELECT COUNT(*) FROM "sulabh_request_statuses" WHERE "sulabh_request_statuses"."sulabh_loan_request_id" = ? AND "sulabh_request_statuses"."status" = ?  [["sulabh_loan_request_id", 7], ["status", "CONFIRMED"]]
---
    <% if session['srole'] === "Requestor" %>
      <% if sulabh_loan_request.sulabh_request_statuses.where(:status => "CONFIRMED").count == 0  %>

SELECT  "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---
        <td><% if (sulabh_loan_request && sulabh_loan_request.sulabh_user_profile_id != nil) %>
          <%= SulabhUserProfile.find(sulabh_loan_request.sulabh_user_profile_id).name %>