app/views/fluidic/loan_confirm.html.erb


  <% sulabh_loan_request = SulabhLoanRequest.find(@lc.sulabh_loan_request_id) %>
  <% sulabh_loan_offer = SulabhLoanOffer.find(@lc.sulabh_loan_offer_id) %>
---
SELECT  "sulabh_loan_requests".* FROM "sulabh_loan_requests" WHERE "sulabh_loan_requests"."id" = ? LIMIT 1  [["id", 8]]
SELECT  "sulabh_loan_offers".* FROM "sulabh_loan_offers" WHERE "sulabh_loan_offers"."id" = ? LIMIT 1  [["id", 2]]

      <tr>
        <td><%= SulabhUserProfile.find(sulabh_loan_request.sulabh_user_profile_id).name %></td>
---
SELECT  "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

        <td><%= sulabh_loan_request.created_at %></td>
        <% if sulabh_loan_request.sulabh_request_statuses.where(:status => "CONFIRMED").count == 0 %>
---
SELECT COUNT(*) FROM "sulabh_request_statuses" WHERE "sulabh_request_statuses"."sulabh_loan_request_id" = ? AND "sulabh_request_statuses"."status" = ?  [["sulabh_loan_request_id", 18], ["status", "CONFIRMED"]]

          <td><%= sulabh_loan_offer.created_at %></td>
          <% if sulabh_loan_offer.sulabh_offer_statuses.where(:status => "CONFIRMED").count == 0 %>
---
SELECT COUNT(*) FROM "sulabh_offer_statuses" WHERE "sulabh_offer_statuses"."sulabh_loan_offer_id" = ? AND "sulabh_offer_statuses"."status" = ?  [["sulabh_loan_offer_id", 2], ["status", "CONFIRMED"]]


<% sulabh_policy = SulabhPolicy.find(@lc.sulabh_policy_id) %>
---
SELECT  "sulabh_policies".* FROM "sulabh_policies" WHERE "sulabh_policies"."id" = ? LIMIT 1  [["id", nil]]

        <td><%= sulabh_policy.enddate %></td>
        <td><%= sulabh_policy.created_at %></td>
---
INSERT INTO "sulabh_policies" ("provider", "policyno", "scheme", "premium", "startdate", "enddate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)


<% sulabh_financial = SulabhFinancial.find(@lc.sulabh_financial_id) %>
---
SELECT  "sulabh_financials".* FROM "sulabh_financials" WHERE "sulabh_financials"."id" = ? LIMIT 1  [["id", 20]]

        <td class="btn-warning"><%= sulabh_financial.EMI %></td>
        <td class="btn-warning"><%= sulabh_financial.created_at %></td>
---
INSERT INTO "sulabh_financials" ("loanamount", "policypremium", "procfee", "approvedintrate", "installmentcount", "installmentfrequency", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)