app/views/fluidic/OffersForRequest.html.erb

SELECT COUNT(*) FROM "sulabh_offer_statuses" WHERE "sulabh_offer_statuses"."sulabh_loan_offer_id" = ? AND "sulabh_offer_statuses"."status" = ?  [["sulabh_loan_offer_id", 1], ["status", "CONFIRMED"]]
---
    <% if session['srole'] === "Requestor" %>
        <% if sulabh_loan_offer.sulabh_offer_statuses.where(:status => "CONFIRMED").count == 0  && sulabh_loan_request &&sulabh_loan_offer.sulabh_user_profile_id != SulabhLoanRequest.find(sulabh_loan_request).sulabh_user_profile_id %>

SELECT  "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
        <% if (sulabh_loan_offer && sulabh_loan_offer.sulabh_user_profile_id != nil) %>
          <%= SulabhUserProfile.find(sulabh_loan_offer.sulabh_user_profile_id).name %>