app/views/fluidic/Requestor_land.html.erb

SELECT  "sulabh_loan_confirms".* FROM "sulabh_loan_confirms" WHERE "sulabh_loan_confirms"."id" = ? LIMIT 1  [["id", nil]]
---
<% if session['lc'] != nil %>
      <% @lc = SulabhLoanConfirm.find(session['lc']) %>