app/views/fluidic/requestflow.html.erb

SELECT "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."mobile" = ?  [["mobile", "8056149277"]]
---
	 <h1> Select your role </h1> <br>
		 <% @su = SulabhUserProfile.where(:mobile => current_user.phoneno)[0] %>

SELECT "sulabh_roles".* FROM "sulabh_roles" WHERE "sulabh_roles"."role" = ?  [["role", "Requestor"]]
---
				<%= form_tag "/fluidic/role_selected", :method => "post" do %>
        			<%= hidden_field_tag "srole" , SulabhRole.find(role.role_id).role %>