app/views/sulabh_user_roles/index.html.erb

SELECT  "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT "sulabh_roles".* FROM "sulabh_roles" WHERE "sulabh_roles"."sulabh_user_role_id" = ?  [[nil, 1]]
---
      <tr>
        <td><%= SulabhUserProfile.find(sulabh_user_role.sulabh_user_profile_id).name %></td>
	<td><%= SulabhRole.find(sulabh_user_role.role_id).role %></td>