app/views/sulabh_user_roles/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
  <strong>Username:</strong>
  <%= SulabhUserProfile.find(@sulabh_user_role.sulabh_user_profile_id).name %>