app/controllers/fluidic_controller.rb

  def role_selected
  	puts "role selected.Recieved param #{params['srole']}"
    if (params['srole'] != nil)
      session['srole'] = params['srole']
    end

  	if (params['srole'] === "Requestor")
  		@su = SulabhUserProfile.where(:mobile => current_user.phoneno)[0]
  		if (@su != nil)
  			@sulabh_loan_requests = @su.sulabh_loan_requests
		  end
    elsif (params['srole'] === "Provider")
      @sulabh_loan_requests = SulabhLoanRequest.where.not( :sulabh_user_profile_id => (SulabhUserProfile.where(:mobile => current_user.phoneno)[0]))
      @sulabh_loan_requests_arr = @sulabh_loan_requests.to_a
      @sulabh_loan_requests_arr.delete_if { |c| c.sulabh_request_statuses.where(:status => "CONFIRMED").count > 0 }
---
SELECT "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."mobile" = ?  [["mobile", "8056149278"]]
SELECT "sulabh_loan_requests".* FROM "sulabh_loan_requests" WHERE "sulabh_loan_requests"."sulabh_user_profile_id" = ?  [[nil, 1]]
SELECT COUNT(*) FROM "sulabh_request_statuses" WHERE "sulabh_request_statuses"."sulabh_loan_request_id" = ? AND "sulabh_request_statuses"."status" = ?  [["sulabh_loan_request_id", 18], ["status", "CONFIRMED"]]

  def fetch_offers
    if (params['srole'] != nil)
      session['srole'] = params['srole']
    end

    if params[:id] != nil
      session['sloan'] = params[:id]
    end
    if session['srole'] === "Requestor"
      if params[:id] != nil
        @sulabh_loan_request = SulabhLoanRequest.find(params[:id])
        @offers = SulabhLoanOffer.where(:sulabh_user_profile_id != @sulabh_loan_request.sulabh_user_profile_id && 'expiresby >= :timenow',:timenow => Time.now   )
      else
        @offers = SulabhLoanOffer.where(:sulabh_user_profile_id != SulabhUserProfile.where(:mobile => current_user.phoneno)[0].id && 'expiresby >= :timenow',:timenow => Time.now   )
---
SELECT  "sulabh_loan_requests".* FROM "sulabh_loan_requests" WHERE "sulabh_loan_requests"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "sulabh_loan_offers".* FROM "sulabh_loan_offers" WHERE "sulabh_loan_offers"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."mobile" = ?  [["mobile", "8056149278"]]

  def loan_confirm
      request_id = params[:id]
      offer_id = params[:id1]

      if (SulabhLoanRequest.find(request_id).sulabh_user_profile_id === SulabhLoanOffer.find(offer_id).sulabh_user_profile_id)
        @notice ="You cant match your offer to a loan from you."
        session['lc'] = session['sloan'] = session['soffer'] = nil
        render "/fluidic/requestflow"
      else

          @lc = SulabhLoanConfirm.new
          @lc.sulabh_loan_request_id = request_id
          @lc.sulabh_loan_offer_id = offer_id
          @sp = SulabhPolicy.new
          @sp = getPolicy(@lc,@sp)

          loanamount = [SulabhLoanRequest.find(@lc.sulabh_loan_request_id).amount,SulabhLoanOffer.find(@lc.sulabh_loan_offer_id).offeramount].min
          interestrate = SulabhLoanOffer.find(@lc.sulabh_loan_offer_id).offerinterestrate
          paybydate =  [SulabhLoanRequest.find(@lc.sulabh_loan_request_id).paybydate !=nil ? SulabhLoanRequest.find(@lc.sulabh_loan_request_id).paybydate : Time.now + 3.months,SulabhLoanOffer.find(@lc.sulabh_loan_offer_id).paybydate != nil ? SulabhLoanOffer.find(@lc.sulabh_loan_offer_id).paybydate : Time.now + 3.months].min
          premium = calculateStandardPremium(loanamount,interestrate,paybydate)

          @sf = SulabhFinancial.new
          @sf.loanamount = loanamount
          @sf.policypremium = premium
          @sf.procfee = loanamount * 0.01
          @sf.approvedintrate = interestrate
          @sf.installmentcount = 3
          @sf.installmentfrequency = "Monthly"

          @sf.save

          @lc.sulabh_policy_id = @sp.id
          @lc.sulabh_financial_id = @sf.id
          @lc.save

          @los = SulabhLoanOffer.find(@lc.sulabh_loan_offer_id).sulabh_offer_statuses.build
          @los.status="CONFIRMED"
          @los.save

          @lrs = SulabhLoanRequest.find(@lc.sulabh_loan_request_id).sulabh_request_statuses.build
          @lrs.status="CONFIRMED"
          @lrs.save
---
SELECT  "sulabh_loan_offers".* FROM "sulabh_loan_offers" WHERE "sulabh_loan_offers"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "sulabh_loan_requests".* FROM "sulabh_loan_requests" WHERE "sulabh_loan_requests"."id" = ? LIMIT 1  [["id", 8]]
SELECT  "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "sulabh_financials" ("loanamount", "policypremium", "procfee", "approvedintrate", "installmentcount", "installmentfrequency", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "sulabh_policies" ("provider", "policyno", "scheme", "premium", "startdate", "enddate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "sulabh_offer_statuses" ("sulabh_loan_offer_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sulabh_loan_offer_id", 8], ["status", "CONFIRMED"], ["created_at", "2017-04-11 04:38:22.509113"], ["updated_at", "2017-04-11 04:38:22.509113"]]
INSERT INTO "sulabh_request_statuses" ("sulabh_loan_request_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sulabh_loan_request_id", 23], ["status", "CONFIRMED"], ["created_at", "2017-04-11 04:38:22.573919"], ["updated_at", "2017-04-11 04:38:22.573919"]]