app/controllers/sulabh_user_profiles_controller.rb

  def index
    @sulabh_user_profiles = SulabhUserProfile.all
---
SELECT "sulabh_user_profiles".* FROM "sulabh_user_profiles"

  def update
    respond_to do |format|
	 if @sulabh_user_profile.update(sulabh_user_profile_params)
---
UPDATE "sulabh_user_profiles" SET "name" = ?, "email" = ?, "accountno" = ?, "ifsc" = ?, "bank" = ?, "locale" = ?, "occupation" = ?, "monthlyrevenue" = ?, "updated_at" = ? WHERE "sulabh_user_profiles"."id" = ?

    def set_sulabh_user_profile
      @sulabh_user_profile = SulabhUserProfile.find(params[:id])
---
SELECT  "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."id" = ? LIMIT 1  [["id", 1]]