app/controllers/sulabh_user_roles_controller.rb

  def index
    @sulabh_user_roles = SulabhUserRole.all
---
SELECT "sulabh_user_roles".* FROM "sulabh_user_roles"

  def create
    @sulabh_user_role = SulabhUserRole.new(sulabh_user_role_params)

    respond_to do |format|
      if @sulabh_user_role.save
---
INSERT INTO "sulabh_user_roles" ("username_id", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username_id", 3], ["role_id", 0], ["created_at", "2017-04-09 22:56:16.809285"], ["updated_at", "2017-04-09 22:56:16.809285"]]

    def set_sulabh_user_role
      @sulabh_user_role = SulabhUserRole.find(params[:id])
---
SELECT  "sulabh_user_roles".* FROM "sulabh_user_roles" WHERE "sulabh_user_roles"."id" = ? LIMIT 1  [["id", 1]]