app/controllers/sulabh_loan_offers_controller.rb

  def index
    @sulabh_loan_offers = SulabhLoanOffer.all
---
SELECT "sulabh_loan_offers".* FROM "sulabh_loan_offers"

  def create
    @su = SulabhUserProfile.where(:mobile => current_user.phoneno)[0]

    @sulabh_loan_offer = @su.sulabh_loan_offers.build(sulabh_loan_offer_params) #SulabhLoanOffer.new(sulabh_loan_offer_params)

    respond_to do |format|
      if @sulabh_loan_offer.save
---
SELECT "sulabh_user_profiles".* FROM "sulabh_user_profiles" WHERE "sulabh_user_profiles"."mobile" = ?  [["mobile", "9876543211"]]
INSERT INTO "sulabh_loan_offers" ("behavescore", "offeramount", "offerinterestrate", "expiresby", "paybydate", "sulabh_user_profile_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_sulabh_loan_offer
      @sulabh_loan_offer = SulabhLoanOffer.find(params[:id])
---
SELECT  "sulabh_loan_offers".* FROM "sulabh_loan_offers" WHERE "sulabh_loan_offers"."id" = ? LIMIT 1  [["id", 1]]