app/controllers/sulabh_loan_requests_controller.rb

  def index
    @sulabh_loan_requests = SulabhLoanRequest.all
---
SELECT "sulabh_loan_requests".* FROM "sulabh_loan_requests"

  def create
    @sulabh_loan_request = SulabhLoanRequest.new(sulabh_loan_request_params)

    respond_to do |format|
      if @sulabh_loan_request.save
---
INSERT INTO "sulabh_loan_requests" ("sulabh_user_profile_id", "behavescore", "amount", "requiredby", "mininterest", "maxinterest", "minpaybyamount", "maxpaybyamount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @sulabh_loan_request.destroy
---
DELETE FROM "sulabh_loan_requests" WHERE "sulabh_loan_requests"."id" = ?  [["id", 15]]

    def set_sulabh_loan_request
      @sulabh_loan_request = SulabhLoanRequest.find(params[:id])
---
SELECT  "sulabh_loan_requests".* FROM "sulabh_loan_requests" WHERE "sulabh_loan_requests"."id" = ? LIMIT 1  [["id", 15]]