app/controllers/sulabh_users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_sulabh_user
      @sulabh_user = SulabhUser.find(params[:id])